cask_args appdir: "/Applications"

tap "hashicorp/tap"

brew "act"
brew "bash"
brew "bash-completion"
brew "cloc"
brew "gh"
brew "git"
brew "nvm"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "harfbuzz"
brew "jq"
brew "k6"
brew "neofetch"
brew "nmap"
# brew "openjdk@11"
# brew "postgresql@14"
brew "pyenv"
brew "telnet"
brew "the_silver_searcher"
brew "hashicorp/tap/terraform"

cask "docker"
cask "betterzip"
cask "bruno"
cask "flycut"
cask "iterm2"
cask "google-cloud-sdk"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "medis"
cask "oracle-jdk@21"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "sf"
cask "sourcetree"
cask "spotify"
cask "temurin"
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "chuckjonas.apex-pmd"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "financialforce.lana"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mtxr.sqltools"
vscode "nucllear.vscode-extension-auto-import"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "solomonkinard.git-blame"
vscode "spoonscen.es6-mocha-snippets"
vscode "steoates.autoimport"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-pack"
vscode "waderyan.gitblame"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
